const QUESTIONS = [
  {
    "id": 1,
    "question": "Жер бетінің кішірейтілген жалпыланған кескіні",
    "options": {
      "A": "профиль",
      "B": "карта",
      "C": "қима",
      "D": "план",
      "E": "сызба"
    },
    "answer": "B"
  },
  {
    "id": 2,
    "question": "Егер өлшенетін арақашықтық 150–200 м шамасынан артық ойлы-қырлы жерде болса, ұзындықты жергілікті дәлдікпен өлшеу үшін екі нүктенің арасын",
    "options": {
      "A": "маркалау қажет",
      "B": "қадалау қажет",
      "C": "шегелеу қажет",
      "D": "реперлеу қажет",
      "E": "штативтеу қажет"
    },
    "answer": "B"
  },
  {
    "id": 3,
    "question": "Өлшенген бұрыштардың қосындысын есептеп, полигонның бұрыштық үйлеспеушілігін мына өрнекпен анықтайды",
    "options": {
      "A": "F = Σβп + Σβк",
      "B": "F = Σb1 + Σb2",
      "C": "F = βн + βк/2",
      "D": "fβ = Σβпр - Σβm",
      "E": "fβ = βпр - βт"
    },
    "answer": "D"
  },
  {
    "id": 4,
    "question": "Арақашықтық өлшенген болса, өлшеу дәлдігін салыстырмалы қате арқылы анықтау",
    "options": {
      "A": "D = √Δx² − Δy²",
      "B": "fc = mD / D = 1 / DmD",
      "C": "ΔY = Y2 + Y1",
      "D": "ΔX = X2 + X1",
      "E": "fc = 1 / DmD"
    },
    "answer": "B"
  },
  {
    "id": 5,
    "question": "Белгілі координаталық жүйе",
    "options": {
      "A": "жергілікті",
      "B": "полярлық",
      "C": "тік бұрышты",
      "D": "географиялық",
      "E": "зоналық"
    },
    "answer": "C"
  },
  {
    "id": 6,
    "question": "Өте жоғары дәлдікті нивелирдің Н-05, 1 км-лік қос жүріс өсімшесінің орташа дәлдігі тең",
    "options": {
      "A": "0,5 мм-ге",
      "B": "0,05 мм-ге",
      "C": "0,3 мм-ге",
      "D": "5,0 мм-ге",
      "E": "0,1 мм-ге"
    },
    "answer": "A"
  },
  {
    "id": 7,
    "question": "Полигонометриялық жүйенің бекітілген пункттерінің биіктіктері",
    "options": {
      "A": "геометриялық нивелирлеумен анықталады",
      "B": "ортадан нивелирлеумен анықталады",
      "C": "тригонометриялық нивелирлеумен анықталады",
      "D": "барометриялық нивелирлеумен анықталады",
      "E": "алға нивелирлеумен анықталады"
    },
    "answer": "C"
  },
  {
    "id": 8,
    "question": "Көлбеу бұрыштың ν формуласы",
    "options": {
      "A": "ν = (КП − КЛ) / 2",
      "B": "V = (КП − КЛ + 180) / 2",
      "C": "ν = (КП − КЛ + 180) / 2",
      "D": "ν = (КП + КЛ) / 2",
      "E": "V = (КП − ν) / 2"
    },
    "answer": "C"
  },
  {
    "id": 9,
    "question": "1 разрядтағы триангуляцияның үшбұрыш қабырғаларының ұзындығы, км",
    "options": {
      "A": "10",
      "B": "20",
      "C": "3",
      "D": "5",
      "E": "15"
    },
    "answer": "E"
  },
  {
    "id": 10,
    "question": "Өлшеулер қателіктері тобының саны",
    "options": {
      "A": "4",
      "B": "3",
      "C": "8",
      "D": "5",
      "E": "2"
    },
    "answer": "B"
  },
  {
    "id": 11,
    "question": "Автоматтандырылған картографиядағы ақпараттар",
    "options": {
      "A": "сандықты және информациялық",
      "B": "сандықты және аналогты",
      "C": "статистикалық және жасандық",
      "D": "геометриялық және математикалық",
      "E": "цифрлық және статистикалық"
    },
    "answer": "B"
  },
  {
    "id": 12,
    "question": "4 класты триангуляциялық тораптың бұрыш өлшеудің орташа квадратты шекті қателігі",
    "options": {
      "A": "3,0″",
      "B": "1,0″",
      "C": "2,5″",
      "D": "4,0″",
      "E": "2,0″"
    },
    "answer": "C"
  },
  {
    "id": 13,
    "question": "Теодолиттік түсірістің планын сызу үшін қолданылатын сызғыш",
    "options": {
      "A": "Дробышев",
      "B": "Бессель",
      "C": "Красовский",
      "D": "Крюгер",
      "E": "Марков"
    },
    "answer": "A"
  },
  {
    "id": 14,
    "question": "Аэрофототүсіріс үлкен аймақтардың карталары мен пландарын жасауда қолданылатын масштабтар",
    "options": {
      "A": "1:100; 1:500",
      "B": "1:1000; 1:5000",
      "C": "1:10000; 1:50000",
      "D": "1:25000; 1:50000",
      "E": "1:500; 1:1000"
    },
    "answer": "C"
  },
  {
    "id": 15,
    "question": "Кері геодезиялық есептегі бастапқы мәліметтер",
    "options": {
      "A": "S",
      "B": "αAB",
      "C": "d",
      "D": "XA, YA, XB, YB",
      "E": "r"
    },
    "answer": "D"
  },
  {
    "id": 16,
    "question": "Егер координаталары белгілі A пунктінен екінші B пунктіне дейінгі арақашықтық d және дирекциялық αAB бұрыш белгілі болғандағы есеп",
    "options": {
      "A": "кері",
      "B": "аралас",
      "C": "тура",
      "D": "аспаптық",
      "E": "теріс"
    },
    "answer": "C"
  },
  {
    "id": 17,
    "question": "Дәлдігі өте жоғары нивелир",
    "options": {
      "A": "Н-3",
      "B": "Н-0,1",
      "C": "Н-05",
      "D": "Н-30",
      "E": "Н-10"
    },
    "answer": "C"
  },
  {
    "id": 18,
    "question": "2 класс триангуляциясындағы қабырға ұзындығы (км)",
    "options": {
      "A": "7–20",
      "B": "30–50",
      "C": "5–25",
      "D": "50–100",
      "E": "10–30"
    },
    "answer": "E"
  },
  {
    "id": 19,
    "question": "Магниттік меридианның бағытын өлшейді",
    "options": {
      "A": "буссольмен",
      "B": "румбпен",
      "C": "теодолитпен",
      "D": "рулеткамен",
      "E": "курвиметрмен"
    },
    "answer": "A"
  },
  {
    "id": 20,
    "question": "Барлық ғылыми зерттеулердің негізі",
    "options": {
      "A": "көп бұрыш",
      "B": "жеке бұрыш",
      "C": "бақылаулар",
      "D": "қайталаулар",
      "E": "тура"
    },
    "answer": "C"
  },
  {
    "id": 21,
    "question": "Теодолиттің вертикаль айналу осі",
    "options": {
      "A": "UU′",
      "B": "VV′",
      "C": "TT′",
      "D": "SS′",
      "E": "ZZ′"
    },
    "answer": "B"
  },
  {
    "id": 22,
    "question": "Остік меридиан бойлығының формуласы",
    "options": {
      "A": "N = cosπ",
      "B": "R = a − b",
      "C": "λ = 6°N − 3",
      "D": "λ = 6°P + 3",
      "E": "R = sinπ"
    },
    "answer": "C"
  },
  {
    "id": 23,
    "question": "Қашықтық өлшегіштерде тұрақты база (b) рейкаларда арнайы маркалармен белгіленеді және қашықтық формуламен анықталады",
    "options": {
      "A": "D = k / b",
      "B": "Δ = D₁ + D / 2",
      "C": "D = (k + k₂) / 2",
      "D": "S = d / b",
      "E": "Δ = D₂ − D₁"
    },
    "answer": "A"
  },
  {
    "id": 24,
    "question": "Румб І ширекте",
    "options": {
      "A": "180° − r",
      "B": "360° − α",
      "C": "360° − r",
      "D": "270° − α",
      "E": "r = 90°"
    },
    "answer": "E"
  },
  {
    "id": 25,
    "question": "Аспап горизонты арқылы да нүктелер биіктіктерін анықтауға болады",
    "options": {
      "A": "Hc = ГИ − c",
      "B": "HB = HA + h",
      "C": "HB = HA − h",
      "D": "Hc = H1 + H2 / 2",
      "E": "Hc = ГИ + h / 2"
    },
    "answer": "A"
  },
  {
    "id": 26,
    "question": "Компастың шеңбері бөлінеді",
    "options": {
      "A": "270°",
      "B": "0°",
      "C": "360°",
      "D": "180°",
      "E": "90°"
    },
    "answer": "C"
  },
  {
    "id": 27,
    "question": "Мемлекеттік геодезиялық тораптар",
    "options": {
      "A": "4 класқа бөлінеді",
      "B": "5 топқа бөлінеді",
      "C": "спутниктік және жердік",
      "D": "тура және кері",
      "E": "3 класқа бөлінеді"
    },
    "answer": "A"
  },
  {
    "id": 28,
    "question": "Landsat спутнигін шығарған мемлекет",
    "options": {
      "A": "АҚШ",
      "B": "Швеция",
      "C": "Қытай",
      "D": "Ресей",
      "E": "Еуропа"
    },
    "answer": "A"
  },
  {
    "id": 29,
    "question": "Жердің планында ескерілмейді",
    "options": {
      "A": "бедері",
      "B": "дөңестігі",
      "C": "шартты белгілері",
      "D": "проекциясы",
      "E": "масштабы"
    },
    "answer": "B"
  },
  {
    "id": 30,
    "question": "Планның проекциясы",
    "options": {
      "A": "конустық",
      "B": "орталық",
      "C": "азимуттық",
      "D": "цилиндрлік",
      "E": "ортоганальдық"
    },
    "answer": "E"
  }
];
